cf_billing/InformationRegisters/энргПредоставленныеПоказания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргПредоставленныеПоказания</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВСрок</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Показания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоказанияТекущегоПериода</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисленияКорректировки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЧастныйСектор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Строение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПомещения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Шкала</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргШкалыПриборовУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТарифнаяЗона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТарифныеЗоны</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерПозиции</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Разделитель</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаРегистратора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокРегистратор</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.энргСменаПоставщика</v8:Type>
						<v8:Type>cfg:DocumentRef.энргОперацияСУслугами</v8:Type>
						<v8:Type>cfg:DocumentRef.энргОперацияСЛицевымСчетом</v8:Type>
						<v8:Type>cfg:DocumentRef.энргОперацияСПриборомУчета</v8:Type>
						<v8:Type>cfg:DocumentRef.энргВводНачальныхОстатков</v8:Type>
						<v8:Type>cfg:DocumentRef.энргПлатежноеПоручениеВходящие</v8:Type>
						<v8:Type>cfg:DocumentRef.энргОбходнойЛист</v8:Type>
						<v8:Type>cfg:DocumentRef.энргУстановитьСхемуПодчиненностиТочекУчета</v8:Type>
						<v8:Type>cfg:DocumentRef.энргУстановитьВидДифференцированностиПриборУчета</v8:Type>
						<v8:Type>cfg:DocumentRef.энргПриходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.энргПерерасчет</v8:Type>
						<v8:Type>cfg:DocumentRef.энргРегистрацияПоказанийАбонента</v8:Type>
						<v8:Type>cfg:DocumentRef.энргАктированиеНедопускаДопускаВПомещение</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьАбонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргКорректировкаПоказаний.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргКорректировкаПоказаний</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПоказанияДо</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоказанияПосле</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Шкала</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргШкалыПриборовУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТарифнаяЗона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТарифныеЗоны</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Разделитель</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокРегистратор</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.энргОперацияСУслугами</v8:Type>
						<v8:Type>cfg:DocumentRef.энргОперацияСЛицевымСчетом</v8:Type>
						<v8:Type>cfg:DocumentRef.энргОперацияСПриборомУчета</v8:Type>
						<v8:Type>cfg:DocumentRef.энргВводНачальныхОстатков</v8:Type>
						<v8:Type>cfg:DocumentRef.энргПлатежноеПоручениеВходящие</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаРегистров</v8:Type>
						<v8:Type>cfg:DocumentRef.энргОбходнойЛист</v8:Type>
						<v8:Type>cfg:DocumentRef.энргУстановитьСхемуПодчиненностиТочекУчета</v8:Type>
						<v8:Type>cfg:DocumentRef.энргУстановитьВидДифференцированностиПриборУчета</v8:Type>
						<v8:Type>cfg:DocumentRef.энргПриходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.энргПерерасчет</v8:Type>
						<v8:Type>cfg:DocumentRef.энргРегистрацияПоказанийАбонента</v8:Type>
						<v8:Type>cfg:DocumentRef.энргАктированиеНедопускаДопускаВПомещение</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргМаксимальныеПоказанияСрез.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргМаксимальныеПоказанияСрез</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Показания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокРегистратор</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.энргСменаПоставщика</v8:Type>
						<v8:Type>cfg:DocumentRef.энргОперацияСУслугами</v8:Type>
						<v8:Type>cfg:DocumentRef.энргОперацияСЛицевымСчетом</v8:Type>
						<v8:Type>cfg:DocumentRef.энргОперацияСПриборомУчета</v8:Type>
						<v8:Type>cfg:DocumentRef.энргВводНачальныхОстатков</v8:Type>
						<v8:Type>cfg:DocumentRef.энргПлатежноеПоручениеВходящие</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаРегистров</v8:Type>
						<v8:Type>cfg:DocumentRef.энргОбходнойЛист</v8:Type>
						<v8:Type>cfg:DocumentRef.энргУстановитьСхемуПодчиненностиТочекУчета</v8:Type>
						<v8:Type>cfg:DocumentRef.энргУстановитьВидДифференцированностиПриборУчета</v8:Type>
						<v8:Type>cfg:DocumentRef.энргПриходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.энргПерерасчет</v8:Type>
						<v8:Type>cfg:DocumentRef.энргРегистрацияПоказанийАбонента</v8:Type>
						<v8:Type>cfg:DocumentRef.энргАктированиеНедопускаДопускаВПомещение</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаРегистратора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЧастныйСектор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Строение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПомещения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Шкала</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргШкалыПриборовУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТарифнаяЗона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТарифныеЗоны</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьАбонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргПредоставленныеПоказания/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет предоставленные показания.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаДляПомещения	-	Строка.
//
Функция ПредоставленныеПоказания(Схема,ПараметрыОтбора,ТаблицаДляПомещения = "") Экспорт
	
	Если Схема = Неопределено Тогда
		Схема  						= Новый СхемаЗапроса;
		Пакет 						= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 						= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));	
	КонецЕсли; 	
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаПредоставленныеПоказания());
	Пакет.ТаблицаДляПомещения 		= ТаблицаДляПомещения;
	ОператорВыбора 					= Пакет.Операторы[0];	
	Источник 						= ОператорВыбора.Источники[0].Источник;
	Параметры 						= Источник.Параметры;		
	
	Если ПараметрыОтбора.Свойство("ЕстьОтборПоКлючамПомещений") И ПараметрыОтбора.ЕстьОтборПоКлючамПомещений Тогда
		НовыйИсточник 			= ОператорВыбора.Источники.Добавить("ЗначенияКлючейПомещений", "энргКлючиПомещений");
		
		СоотвествиеУсловий	= Новый Соответствие;
		СоотвествиеУсловий.Вставить("Помещение", "Помещение");
		СоотвествиеУсловий.Вставить("Строение", "Строение");
		МассивУсловий		= Новый Массив;
		МассивУсловий.Добавить(Новый Структура("ТипУсловия,СоотвествиеУсловий","ТипУсловияРавно", СоотвествиеУсловий));
		
		энргФормированиеТекстовЗапроса.УстановитьИсточникЗапроса(ОператорВыбора.Источники[0], НовыйИсточник, ТипСоединенияСхемыЗапроса.Внутреннее, МассивУсловий);  
		
	КонецЕсли;
	
	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		ДоступныеПараметры 			= "Организация, ПериодНачисления, ПериодНачисленияКорректировки, Район, ЧастныйСектор, Строение, Помещение, ПриборУчета, Шкала, ТарифнаяЗона, НомерПозиции, Разделитель, ДатаРегистратора, ДокРегистратор";
		ИмяТаблицы 					= "ПредоставленныеПоказания";
		энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(ОператорВыбора.Отбор,ИмяТаблицы,ПараметрыОтбора.ПараметрыВТ,ДоступныеПараметры);		
	КонецЕсли;
	
КонецФункции

// Заполняет максимальные показания срез.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаДляПомещения	-	Строка.
//
Функция МаксимальныеПоказанияСрез(Схема,ПараметрыОтбора,ТаблицаДляПомещения = "") Экспорт
	
	Если Схема = Неопределено Тогда
		Схема  						= Новый СхемаЗапроса;
		Пакет 						= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 						= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));	
	КонецЕсли; 	
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаМаксимальныеПоказанияСрез());
	Пакет.ТаблицаДляПомещения 		= ТаблицаДляПомещения;
	ОператорВыбора 					= Пакет.Операторы[0];	
	Если ПараметрыОтбора.Свойство("ЕстьОтборПоКлючамПомещений") И ПараметрыОтбора.ЕстьОтборПоКлючамПомещений Тогда
		НовыйИсточник 			= ОператорВыбора.Источники.Добавить("ЗначенияКлючейПомещений", "энргКлючиПомещений");
		
		СоотвествиеУсловий	= Новый Соответствие;
		СоотвествиеУсловий.Вставить("Помещение", "Помещение");
		СоотвествиеУсловий.Вставить("Строение", "Строение");
		МассивУсловий		= Новый Массив;
		МассивУсловий.Добавить(Новый Структура("ТипУсловия,СоотвествиеУсловий","ТипУсловияРавно", СоотвествиеУсловий));
		
		энргФормированиеТекстовЗапроса.УстановитьИсточникЗапроса(ОператорВыбора.Источники[0], НовыйИсточник, ТипСоединенияСхемыЗапроса.Внутреннее, МассивУсловий);  
		
	КонецЕсли;		
	
	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		ДоступныеПараметры 			= "Организация, ПериодНачисления, Район, ЧастныйСектор, Строение, Помещение, ПриборУчета, Шкала, ТарифнаяЗона";
		ИмяТаблицы 					= "МаксимальныеПоказанияСрез";
		энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(ОператорВыбора.Отбор,ИмяТаблицы,ПараметрыОтбора.ПараметрыВТ,ДоступныеПараметры);		
	КонецЕсли;
	
КонецФункции

// Заполняет максимальные показания срез с учетом корректировки.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаДляПомещения	-	Строка.
//
Функция МаксимальныеПоказанияСрезСУчетомКорректировки(Схема,ПараметрыОтбора,ТаблицаДляПомещения = "") Экспорт
	
	Если Схема = Неопределено Тогда
		Схема  						= Новый СхемаЗапроса;
		Пакет 						= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 						= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));	
	КонецЕсли; 	
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаМаксимальныеПоказанияСрез());
	Пакет.ТаблицаДляПомещения 		= "МаксимальныеПоказанияСрезДоКорректировки";
	ОператорВыбора 					= Пакет.Операторы[0];
	
	Если ПараметрыОтбора.Свойство("ЕстьОтборПоКлючамПомещений") И ПараметрыОтбора.ЕстьОтборПоКлючамПомещений Тогда
		НовыйИсточник 			= ОператорВыбора.Источники.Добавить("ЗначенияКлючейПомещений", "энргКлючиПомещений");
		
		СоотвествиеУсловий	= Новый Соответствие;
		СоотвествиеУсловий.Вставить("Помещение", "Помещение");
		СоотвествиеУсловий.Вставить("Строение", "Строение");
		МассивУсловий		= Новый Массив;
		МассивУсловий.Добавить(Новый Структура("ТипУсловия,СоотвествиеУсловий","ТипУсловияРавно", СоотвествиеУсловий));
		
		энргФормированиеТекстовЗапроса.УстановитьИсточникЗапроса(ОператорВыбора.Источники[0], НовыйИсточник, ТипСоединенияСхемыЗапроса.Внутреннее, МассивУсловий);  
		
	КонецЕсли;		
	
	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		ДоступныеПараметры 			= "Организация, ПериодНачисления, Район, ЧастныйСектор, Строение, Помещение, ПриборУчета, Шкала, ТарифнаяЗона";
		ИмяТаблицы 					= "МаксимальныеПоказанияСрез";
		энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(ОператорВыбора.Отбор,ИмяТаблицы,ПараметрыОтбора.ПараметрыВТ,ДоступныеПараметры);		
	КонецЕсли;
		
	РегистрыСведений.энргКорректировкаПоказаний.СкорректированныеПоказания(Схема,ПараметрыОтбора,"МаксимальныеПоказанияСрезКорректировка");
	
	Пакет 									= Схема.ПакетЗапросов.Добавить();
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаСкорректированныхПоказаний());
	Пакет.ТаблицаДляПомещения 				= ТаблицаДляПомещения;
	
КонецФункции

// Получает набор начальных показаний расчетного периода.
//
// Параметры:
//  ДанныеЗаполнения	-	РезультатЗапроса.
// 
// Возвращаемое значение:
//   РегистрСведенийНаборЗаписей.энргПредоставленныеПоказания.
//
Функция НаборНачальныеПоказанияРасчетногоПериода(ДанныеЗаполнения) Экспорт 
	
	Набор  							= СоздатьНаборЗаписей();
	Выборка 						= ДанныеЗаполнения.Выбрать();
	Пока Выборка.Следующий() Цикл
		СтрокаНабора 				= Набор.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаНабора, Выборка);
		СтрокаНабора.НомерПозиции = - 1;
	КонецЦикла;
	
	Возврат Набор;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Получает текст запроса предоставленные показания.
// 
// Возвращаемое значение:
//   Строка.
//
Функция ТекстЗапросаПредоставленныеПоказания() Экспорт 
	
	Текст = 
	"ВЫБРАТЬ
	|	ПредоставленныеПоказания.Организация КАК Организация,
	|	ПредоставленныеПоказания.ПериодНачисления КАК ПериодНачисления,
	|	ПредоставленныеПоказания.Район КАК Район,
	|	ПредоставленныеПоказания.ЧастныйСектор КАК ЧастныйСектор,
	|	ПредоставленныеПоказания.Строение КАК Строение,
	|	ПредоставленныеПоказания.Помещение КАК Помещение,
	|	ПредоставленныеПоказания.ПриборУчета КАК ПриборУчета,
	|	ПредоставленныеПоказания.Шкала КАК Шкала,
	|	ПредоставленныеПоказания.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ПредоставленныеПоказания.НомерПозиции КАК НомерПозиции,
	|	ПредоставленныеПоказания.Разделитель КАК Разделитель,
	|	ПредоставленныеПоказания.ДатаРегистратора КАК ДатаРегистратора,
	|	ПредоставленныеПоказания.ДокРегистратор КАК ДокРегистратор,
	|	ПредоставленныеПоказания.ВСрок КАК ВСрок,
	|	ПредоставленныеПоказания.Показания КАК Показания,
	|	ПредоставленныеПоказания.ПоказанияТекущегоПериода КАК ПоказанияТекущегоПериода,
	|	ПредоставленныеПоказания.ПериодНачисленияКорректировки КАК ПериодНачисленияКорректировки
	|ИЗ
	|	РегистрСведений.энргПредоставленныеПоказания КАК ПредоставленныеПоказания";
	
	Возврат Текст;
	
КонецФункции

// Получает текст запроса максимальные показания срез.
// 
// Возвращаемое значение:
//   Строка.
//
Функция ТекстЗапросаМаксимальныеПоказанияСрез() Экспорт 
	Текст  = 
	"ВЫБРАТЬ
	|	МаксимальныеПоказанияСрез.Организация КАК Организация,
	|	МаксимальныеПоказанияСрез.ПериодНачисления КАК ПериодНачисления,
	|	МаксимальныеПоказанияСрез.Район КАК Район,
	|	МаксимальныеПоказанияСрез.ЧастныйСектор КАК ЧастныйСектор,
	|	МаксимальныеПоказанияСрез.Строение КАК Строение,
	|	МаксимальныеПоказанияСрез.Помещение КАК Помещение,
	|	МаксимальныеПоказанияСрез.ПриборУчета КАК ПриборУчета,
	|	МаксимальныеПоказанияСрез.Шкала КАК Шкала,
	|	МаксимальныеПоказанияСрез.ТарифнаяЗона КАК ТарифнаяЗона,
	|	МаксимальныеПоказанияСрез.Показания КАК Показания,
	|	МаксимальныеПоказанияСрез.ДокРегистратор КАК ДокРегистратор,
	|	МаксимальныеПоказанияСрез.ДатаРегистратора КАК ДатаРегистратора
	|ИЗ
	|	РегистрСведений.энргМаксимальныеПоказанияСрез КАК МаксимальныеПоказанияСрез";
	Возврат Текст;	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаСкорректированныхПоказаний()
	Текст =
	"ВЫБРАТЬ
	|	МаксимальныеПоказанияСрезДоКорректировки.Организация КАК Организация,
	|	МаксимальныеПоказанияСрезДоКорректировки.Район КАК Район,
	|	МаксимальныеПоказанияСрезДоКорректировки.ЧастныйСектор КАК ЧастныйСектор,
	|	МаксимальныеПоказанияСрезДоКорректировки.Строение КАК Строение,
	|	МаксимальныеПоказанияСрезДоКорректировки.Помещение КАК Помещение,
	|	МаксимальныеПоказанияСрезДоКорректировки.ПриборУчета КАК ПриборУчета,
	|	МаксимальныеПоказанияСрезДоКорректировки.Шкала КАК Шкала,
	|	МаксимальныеПоказанияСрезДоКорректировки.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ЕСТЬNULL(МаксимальныеПоказанияСрезКорректировка.ПоказанияПосле, МаксимальныеПоказанияСрезДоКорректировки.Показания) КАК Показания,
	|	МаксимальныеПоказанияСрезДоКорректировки.ДокРегистратор КАК ДокРегистратор,
	|	МаксимальныеПоказанияСрезДоКорректировки.ДатаРегистратора КАК ДатаРегистратора,
	|	МаксимальныеПоказанияСрезДоКорректировки.ПериодНачисления КАК ПериодНачисления
	|ИЗ
	|	МаксимальныеПоказанияСрезДоКорректировки КАК МаксимальныеПоказанияСрезДоКорректировки
	|		ЛЕВОЕ СОЕДИНЕНИЕ МаксимальныеПоказанияСрезКорректировка КАК МаксимальныеПоказанияСрезКорректировка
	|		ПО МаксимальныеПоказанияСрезДоКорректировки.Организация = МаксимальныеПоказанияСрезКорректировка.Организация
	|			И МаксимальныеПоказанияСрезДоКорректировки.Район = МаксимальныеПоказанияСрезКорректировка.Район
	|			И МаксимальныеПоказанияСрезДоКорректировки.ПриборУчета = МаксимальныеПоказанияСрезКорректировка.ПриборУчета
	|			И МаксимальныеПоказанияСрезДоКорректировки.Шкала = МаксимальныеПоказанияСрезКорректировка.Шкала
	|			И МаксимальныеПоказанияСрезДоКорректировки.ТарифнаяЗона = МаксимальныеПоказанияСрезКорректировка.ТарифнаяЗона
	|			И МаксимальныеПоказанияСрезДоКорректировки.ДокРегистратор = МаксимальныеПоказанияСрезКорректировка.ДокРегистратор
	//|			И МаксимальныеПоказанияСрезДоКорректировки.ПериодНачисления = МаксимальныеПоказанияСрезКорректировка.ПериодНачисления
	|			И МаксимальныеПоказанияСрезДоКорректировки.Показания = МаксимальныеПоказанияСрезКорректировка.ПоказанияДо
	|			И МаксимальныеПоказанияСрезДоКорректировки.Строение = МаксимальныеПоказанияСрезКорректировка.Строение
	|			И МаксимальныеПоказанияСрезДоКорректировки.Помещение = МаксимальныеПоказанияСрезКорректировка.Помещение
	|			И МаксимальныеПоказанияСрезДоКорректировки.ЧастныйСектор = МаксимальныеПоказанияСрезКорректировка.ЧастныйСектор";
	
	Возврат Текст;
	

КонецФункции

#КонецОбласти

#КонецЕсли
